# Exercise: Analyzing Chinook Database

Preparation I've done:
 - Retrieve the dataset and load it
 - Load the %sql extension and point it at the database
 - Display the tables and an example query

Additional steps you might take:
 - Add libraries for visualization (matplotlib, seaborn, plotly)
 - Add libraries for statistics (numpy)
 - Explore the dataset using SQL and/or pandas

----

1. Retrieve a list of all the tracks in the database, displaying only the track name and the name of the album it belongs to. Limit the result to the first 5 rows.
   > Operations: `SELECT`
2. Find the total number of customers from each country. Display the country name and the corresponding count. Order the results by the count in descending order.
   > Operations: `SELECT`, `COUNT`, `GROUP BY`, `ORDER BY`
3. Identify the top 5 genres with the highest number of tracks. Display the genre name along with the total number of tracks for each genre.
   > Operations: `SELECT`, `COUNT`, `GROUP BY`, `ORDER BY`
4. Determine the average invoice total for each customer, considering both the album and individual track purchases. Display the customer's first and last name along with the average invoice total. Order the results by the average invoice total in descending order.
   > Operations: `SELECT`, `AVG`, `JOIN`, `GROUP BY`, `ORDER BY`
5. Identify the customer who spent the most on music purchases. Display the customer's first and last name, along with the total amount spent.
   > Operations: `SELECT`, `SUM`, `JOIN`, `GROUP BY`, `ORDER BY`, `LIMIT`

In [2]:
# Load chinook dataset and query it using SQL magic into pandas dataframes
import pandas as pd
import sqlite3
%load_ext sql

# Load data
conn = sqlite3.connect("chinook.sqlite")

# Tell %sql about the database
%sql sqlite:///chinook.sqlite

C:\Users\wilso\AppData\Local\Temp\ipykernel_22220\3955575705.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [ ]:

# List tables in database
query = "SELECT name FROM sqlite_master WHERE type='table';"

# Read data into a Pandas DataFrame
tables = %sql $query

# Print head
display(tables)

# Query to get the first 5 rows of the `albums` table
result = %sql SELECT * FROM albums LIMIT 5;

# Display query result, note that Pandas DataFrame is returned!
display(result)

In [19]:
# 1 tracks
result = %sql SELECT trackid, albumid FROM tracks LIMIT 5;
display(result)

 * sqlite:///chinook.sqlite
Done.

[(1, 1), (6, 1), (7, 1), (8, 1), (9, 1)]

In [12]:
#2 Country names and counts by descending
query = "SELECT DISTINCT country, COUNT(customerid) AS Counts FROM customers GROUP BY country ORDER BY Counts DESC;"  
result = %sql $query
display(result)

 * sqlite:///chinook.sqlite
Done.

[('USA', 13),
 ('Canada', 8),
 ('France', 5),
 ('Brazil', 5),
 ('Germany', 4),
 ('United Kingdom', 3),
 ('Portugal', 2),
 ('India', 2),
 ('Czech Republic', 2),
 ('Sweden', 1),
 ('Spain', 1),
 ('Poland', 1),
 ('Norway', 1),
 ('Netherlands', 1),
 ('Italy', 1),
 ('Ireland', 1),
 ('Hungary', 1),
 ('Finland', 1),
 ('Denmark', 1),
 ('Chile', 1),
 ('Belgium', 1),
 ('Austria', 1),
 ('Australia', 1),
 ('Argentina', 1)]

In [20]:
#3 Top Genre and counts of tracks
query = "SELECT DISTINCT genreid, COUNT(trackid) AS Counts FROM tracks GROUP BY genreid ORDER BY Counts DESC LIMIT 5;"  
result = %sql $query
display(result)

 * sqlite:///chinook.sqlite
Done.

[(1, 1297), (7, 579), (3, 374), (4, 332), (2, 130)]

In [28]:
#4 Names and avg invoice of customers
query = "SELECT FirstName, LastName, AVG(total) AS Avginvoice FROM customers LEFT JOIN invoices USING(customerid) GROUP BY customerid ORDER BY Avginvoice DESC;"
result = %sql $query
display(result)

 * sqlite:///chinook.sqlite
Done.

[('Helena', 'Holý', 7.088571428571428),
 ('Richard', 'Cunningham', 6.8028571428571425),
 ('Luis', 'Rojas', 6.659999999999999),
 ('Ladislav', 'Kovács', 6.517142857142857),
 ('Hugh', "O'Reilly", 6.517142857142857),
 ('Frank', 'Ralston', 6.231428571428571),
 ('Julia', 'Barnett', 6.231428571428571),
 ('Fynn', 'Zimmermann', 6.231428571428571),
 ('Puja', 'Srivastava', 6.1066666666666665),
 ('Astrid', 'Gruber', 6.088571428571428),
 ('Victor', 'Stevens', 6.088571428571428),
 ('Terhi', 'Hämäläinen', 5.945714285714286),
 ('František', 'Wichterlová', 5.8028571428571425),
 ('Isabelle', 'Mercier', 5.8028571428571425),
 ('Johannes', 'Van der Berg', 5.8028571428571425),
 ('Luís', 'Gonçalves', 5.659999999999999),
 ('François', 'Tremblay', 5.659999999999999),
 ('Bjørn', 'Hansen', 5.659999999999999),
 ('Jack', 'Smith', 5.659999999999999),
 ('Dan', 'Miller', 5.659999999999999),
 ('Heather', 'Leacock', 5.659999999999999),
 ('João', 'Fernandes', 5.659999999999999),
 ('Wyatt', 'Girard', 5.659999999999999),
 ('Jennifer', 'Peterson', 5.517142857142857),
 ('Tim', 'Goyer', 5.517142857142857),
 ('Camille', 'Bernard', 5.517142857142857),
 ('Dominique', 'Lefebvre', 5.517142857142857),
 ('Joakim', 'Johansson', 5.517142857142857),
 ('Manoj', 'Pareek', 5.517142857142857),
 ('Leonie', 'Köhler', 5.374285714285714),
 ('Daan', 'Peeters', 5.374285714285714),
 ('Kara', 'Nielsen', 5.374285714285714),
 ('Eduardo', 'Martins', 5.374285714285714),
 ('Alexandre', 'Rocha', 5.374285714285714),
 ('Roberto', 'Almeida', 5.374285714285714),
 ('Fernanda', 'Ramos', 5.374285714285714),
 ('Mark', 'Philips', 5.374285714285714),
 ('Frank', 'Harris', 5.374285714285714),
 ('Michelle', 'Brooks', 5.374285714285714),
 ('Kathy', 'Chase', 5.374285714285714),
 ('John', 'Gordon', 5.374285714285714),
 ('Patrick', 'Gray', 5.374285714285714),
 ('Robert', 'Brown', 5.374285714285714),
 ('Edward', 'Francis', 5.374285714285714),
 ('Martha', 'Silk', 5.374285714285714),
 ('Aaron', 'Mitchell', 5.374285714285714),
 ('Ellie', 'Sullivan', 5.374285714285714),
 ('Madalena', 'Sampaio', 5.374285714285714),
 ('Hannah', 'Schneider', 5.374285714285714),
 ('Niklas', 'Schröder', 5.374285714285714),
 ('Marc', 'Dubois', 5.374285714285714),
 ('Lucas', 'Mancini', 5.374285714285714),
 ('Stanisław', 'Wójcik', 5.374285714285714),
 ('Enrique', 'Muñoz', 5.374285714285714),
 ('Emma', 'Jones', 5.374285714285714),
 ('Phil', 'Hughes', 5.374285714285714),
 ('Steve', 'Murray', 5.374285714285714),
 ('Mark', 'Taylor', 5.374285714285714),
 ('Diego', 'Gutiérrez', 5.374285714285714)]

In [29]:
#5 Names and sum invoice of customers
query = "SELECT FirstName, LastName, SUM(total) AS Totalspending FROM customers LEFT JOIN invoices USING(customerid) GROUP BY customerid ORDER BY Totalspending DESC LIMIT 1;"
result = %sql $query
display(result)

 * sqlite:///chinook.sqlite
Done.

[('Helena', 'Holý', 49.62)]